; domain
(define (domain miconic)
  (:requirements :strips)
  (:types floor person)

(:predicates
  (origin ?p - person ?f - floor)
  (destin ?p - person ?f - floor)  
  (above ?f1 ?f2 - floor)
  (boarded ?p - person)
  (served ?p - person)
  (lift-at ?f - floor)
)

(:action board
  :parameters (?o1 - floor ?o2 - person)
  :precondition (and (lift-at ?o1) (origin ?o2 ?o1))
  :effect (boarded ?o2))

(:action depart
  :parameters (?o1 - floor ?o2 - person)
  :precondition (and (lift-at ?o1) (destin ?o2 ?o1)
		     (boarded ?o2))
  :effect (and (not (boarded ?o2))
	       (served ?o2)))
(:action up
  :parameters (?o1 ?o2 - floor)
  :precondition (and (lift-at ?o1) (above ?o1 ?o2))
  :effect (and (lift-at ?o2) (not (lift-at ?o1))))

(:action down
  :parameters (?o1 ?o2 - floor)
  :precondition (and (lift-at ?o1) (above ?o2 ?o1))
  :effect (and (lift-at ?o2) (not (lift-at ?o1))))
)

; problem
(define (problem mixed)
  (:domain miconic)
  (:objects p2 -  person p1 -  person p0 -  person p4 -  person p3 -  person p5 -  person p6 -  person p7 -  person f0 -  floor f1 -  floor f2 -  floor f3 -  floor f4 -  floor f5 -  floor f6 -  floor )
  (:init (destin p3 f4) (above f4 f5) (above f1 f3) (above f3 f5) (origin p5 f0) (above f1 f4) (destin p7 f6) (destin p1 f0) (above f1 f6) (origin p7 f0) (origin p0 f5) (above f0 f6) (above f0 f5) (above f0 f3) (above f0 f1) (origin p4 f5) (boarded p7) (destin p2 f5) (origin p3 f6) (destin p0 f1) (origin p6 f5) (above f5 f6) (above f2 f6) (destin p5 f3) (destin p6 f0) (above f4 f6) (above f2 f3) (origin p2 f2) (origin p1 f2) (above f0 f2) (above f1 f5) (destin p4 f2) (above f3 f6) (above f1 f2) (boarded p5) (boarded p6) (above f3 f4) (above f0 f4) (above f2 f4) (above f2 f5) (boarded p1) (served p4) (boarded p0) (served p2) (lift-at f3) )
  (:goal (and (destin p3 f4)(above f4 f5)(above f1 f3)(above f3 f5)(origin p5 f0)(above f1 f4)(destin p7 f6)(destin p1 f0)(above f1 f6)(origin p7 f0)(origin p0 f5)(above f0 f6)(above f0 f5)(above f0 f3)(above f0 f1)(origin p4 f5)(destin p2 f5)(origin p3 f6)(destin p0 f1)(origin p6 f5)(above f5 f6)(above f2 f6)(destin p5 f3)(destin p6 f0)(above f4 f6)(above f2 f3)(origin p2 f2)(origin p1 f2)(above f0 f2)(above f1 f5)(destin p4 f2)(above f3 f6)(above f1 f2)(boarded p6)(above f3 f4)(above f0 f4)(above f2 f4)(above f2 f5)(boarded p1)(served p4)(boarded p0)(served p2)(served p5)(boarded p3)(served p7)(lift-at f0)(not (origin p0 f0))(not (origin p0 f1))(not (origin p0 f2))(not (origin p0 f3))(not (origin p0 f4))(not (origin p0 f6))(not (origin p1 f0))(not (origin p1 f1))(not (origin p1 f3))(not (origin p1 f4))(not (origin p1 f5))(not (origin p1 f6))(not (origin p2 f0))(not (origin p2 f1))(not (origin p2 f3))(not (origin p2 f4))(not (origin p2 f5))(not (origin p2 f6))(not (origin p3 f0))(not (origin p3 f1))(not (origin p3 f2))(not (origin p3 f3))(not (origin p3 f4))(not (origin p3 f5))(not (origin p4 f0))(not (origin p4 f1))(not (origin p4 f2))(not (origin p4 f3))(not (origin p4 f4))(not (origin p4 f6))(not (origin p5 f1))(not (origin p5 f2))(not (origin p5 f3))(not (origin p5 f4))(not (origin p5 f5))(not (origin p5 f6))(not (origin p6 f0))(not (origin p6 f1))(not (origin p6 f2))(not (origin p6 f3))(not (origin p6 f4))(not (origin p6 f6))(not (origin p7 f1))(not (origin p7 f2))(not (origin p7 f3))(not (origin p7 f4))(not (origin p7 f5))(not (origin p7 f6))(not (destin p0 f0))(not (destin p0 f2))(not (destin p0 f3))(not (destin p0 f4))(not (destin p0 f5))(not (destin p0 f6))(not (destin p1 f1))(not (destin p1 f2))(not (destin p1 f3))(not (destin p1 f4))(not (destin p1 f5))(not (destin p1 f6))(not (destin p2 f0))(not (destin p2 f1))(not (destin p2 f2))(not (destin p2 f3))(not (destin p2 f4))(not (destin p2 f6))(not (destin p3 f0))(not (destin p3 f1))(not (destin p3 f2))(not (destin p3 f3))(not (destin p3 f5))(not (destin p3 f6))(not (destin p4 f0))(not (destin p4 f1))(not (destin p4 f3))(not (destin p4 f4))(not (destin p4 f5))(not (destin p4 f6))(not (destin p5 f0))(not (destin p5 f1))(not (destin p5 f2))(not (destin p5 f4))(not (destin p5 f5))(not (destin p5 f6))(not (destin p6 f1))(not (destin p6 f2))(not (destin p6 f3))(not (destin p6 f4))(not (destin p6 f5))(not (destin p6 f6))(not (destin p7 f0))(not (destin p7 f1))(not (destin p7 f2))(not (destin p7 f3))(not (destin p7 f4))(not (destin p7 f5))(not (above f0 f0))(not (above f1 f0))(not (above f1 f1))(not (above f2 f0))(not (above f2 f1))(not (above f2 f2))(not (above f3 f0))(not (above f3 f1))(not (above f3 f2))(not (above f3 f3))(not (above f4 f0))(not (above f4 f1))(not (above f4 f2))(not (above f4 f3))(not (above f4 f4))(not (above f5 f0))(not (above f5 f1))(not (above f5 f2))(not (above f5 f3))(not (above f5 f4))(not (above f5 f5))(not (above f6 f0))(not (above f6 f1))(not (above f6 f2))(not (above f6 f3))(not (above f6 f4))(not (above f6 f5))(not (above f6 f6))(not (boarded p2))(not (boarded p4))(not (boarded p5))(not (boarded p7))(not (served p0))(not (served p1))(not (served p3))(not (served p6))(not (lift-at f1))(not (lift-at f2))(not (lift-at f3))(not (lift-at f4))(not (lift-at f5))(not (lift-at f6)))))

; plan
1. (depart f3 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 179 of 184
2. (up f3 f6)
   deleted: (lift-at f3)
   added: (lift-at f6)
   goals met: 179 of 184
3. (board f6 p3)
   added: (boarded p3)
   goals met: 180 of 184
4. (depart f6 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 182 of 184
5. (down f6 f0)
   deleted: (lift-at f6)
   added: (lift-at f0)
   goals met: 184 of 184
